Ran Plan for 4 projects:

1. dir: `running/sg` workspace: `default`
1. dir: `running/sg2` workspace: `default`
1. dir: `.` workspace: `default`
1. dir: `running` workspace: `default`

### 1. dir: `running/sg` workspace: `default`
<details><summary>Show Output</summary>

```diff
[terragrunt] [/home/atlantis/.atlantis/repos/sarveshhh/atlantis-example/14/default/running/sg] 2020/08/28 11:54:36 Running command: terraform --version
[terragrunt] 2020/08/28 11:54:36 Terraform version: 0.12.28
[terragrunt] 2020/08/28 11:54:36 Reading Terragrunt config file at /home/atlantis/.atlantis/repos/sarveshhh/atlantis-example/14/default/running/sg/terragrunt.hcl
[terragrunt] 2020/08/28 11:54:36 Initializing remote state for the s3 backend
[terragrunt] 2020/08/28 11:54:36 WARNING: encryption is not enabled on the S3 remote state bucket capterra-terraform-state-944864126557. Terraform state files may contain secrets, so we STRONGLY recommend enabling encryption!
[terragrunt] 2020/08/28 11:54:37 WARNING: Versioning is not enabled for the remote state S3 bucket capterra-terraform-state-944864126557. We recommend enabling versioning so that you can roll back to previous versions of your Terraform state in case of error.
[terragrunt] 2020/08/28 11:54:37 Running command: terraform init -backend-config=bucket=capterra-terraform-state-944864126557 -backend-config=key=sg/terraform.tfstate -backend-config=region=us-east-1

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Checking for available provider plugins...
- Downloading plugin for provider "aws" (hashicorp/aws) 3.4.0...

The following providers do not have any version constraints in configuration,
so the latest version was installed.

To prevent automatic upgrades to new major versions that may contain breaking
changes, it is recommended to add version = "..." constraints to the
corresponding provider blocks in configuration, with the constraint strings
suggested below.

* provider.aws: version = "~> 3.4"

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m

[terragrunt] [/home/atlantis/.atlantis/repos/sarveshhh/atlantis-example/14/default/running/sg] 2020/08/28 11:54:47 Running command: terraform --version
[terragrunt] 2020/08/28 11:54:49 Terraform version: 0.12.28
[terragrunt] 2020/08/28 11:54:49 Reading Terragrunt config file at /home/atlantis/.atlantis/repos/sarveshhh/atlantis-example/14/default/running/sg/terragrunt.hcl
[terragrunt] 2020/08/28 11:54:49 Running command: terraform plan
[0m[1mRefreshing Terraform state in-memory prior to plan...[0m
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.
[0m

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # aws_security_group.sg-1[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_security_group" "sg-1" {
      [32m+[0m [0m[1m[0marn[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m            = "Managed by Terraform"
      [32m+[0m [0m[1m[0megress[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mingress[0m[0m                = [
          [32m+[0m [0m{
              [32m+[0m [0mcidr_blocks      = [
                  [32m+[0m [0m"22.22.22.27/32",
                ]
              [32m+[0m [0mdescription      = ""
              [32m+[0m [0mfrom_port        = 8080
              [32m+[0m [0mipv6_cidr_blocks = []
              [32m+[0m [0mprefix_list_ids  = []
              [32m+[0m [0mprotocol         = "tcp"
              [32m+[0m [0msecurity_groups  = []
              [32m+[0m [0mself             = false
              [32m+[0m [0mto_port          = 8080
            },
        ]
      [32m+[0m [0m[1m[0mname[0m[0m                   = "terraform-sg-1"
      [32m+[0m [0m[1m[0mowner_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mrevoke_rules_on_delete[0m[0m = false
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                 = (known after apply)
    }

[0m[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.[0m

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d running/sg`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.capstage.net/lock?id=sarveshhh%252Fatlantis-example%252Frunning%252Fsg%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d running/sg`
</details>

---
### 2. dir: `running/sg2` workspace: `default`
<details><summary>Show Output</summary>

```diff
[terragrunt] [/home/atlantis/.atlantis/repos/sarveshhh/atlantis-example/14/default/running/sg2] 2020/08/28 11:55:00 Running command: terraform --version
[terragrunt] 2020/08/28 11:55:00 Terraform version: 0.12.28
[terragrunt] 2020/08/28 11:55:00 Reading Terragrunt config file at /home/atlantis/.atlantis/repos/sarveshhh/atlantis-example/14/default/running/sg2/terragrunt.hcl
[terragrunt] 2020/08/28 11:55:00 Initializing remote state for the s3 backend
[terragrunt] 2020/08/28 11:55:00 WARNING: encryption is not enabled on the S3 remote state bucket capterra-terraform-state-944864126557. Terraform state files may contain secrets, so we STRONGLY recommend enabling encryption!
[terragrunt] 2020/08/28 11:55:00 WARNING: Versioning is not enabled for the remote state S3 bucket capterra-terraform-state-944864126557. We recommend enabling versioning so that you can roll back to previous versions of your Terraform state in case of error.
[terragrunt] 2020/08/28 11:55:00 Running command: terraform init -backend-config=bucket=capterra-terraform-state-944864126557 -backend-config=key=sg2/terraform.tfstate -backend-config=region=us-east-1

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Checking for available provider plugins...
- Downloading plugin for provider "aws" (hashicorp/aws) 3.4.0...

The following providers do not have any version constraints in configuration,
so the latest version was installed.

To prevent automatic upgrades to new major versions that may contain breaking
changes, it is recommended to add version = "..." constraints to the
corresponding provider blocks in configuration, with the constraint strings
suggested below.

* provider.aws: version = "~> 3.4"

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m

[terragrunt] [/home/atlantis/.atlantis/repos/sarveshhh/atlantis-example/14/default/running/sg2] 2020/08/28 11:55:11 Running command: terraform --version
[terragrunt] 2020/08/28 11:55:13 Terraform version: 0.12.28
[terragrunt] 2020/08/28 11:55:13 Reading Terragrunt config file at /home/atlantis/.atlantis/repos/sarveshhh/atlantis-example/14/default/running/sg2/terragrunt.hcl
[terragrunt] 2020/08/28 11:55:13 Running command: terraform plan
[0m[1mRefreshing Terraform state in-memory prior to plan...[0m
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.
[0m

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # aws_security_group.instance[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_security_group" "instance" {
      [32m+[0m [0m[1m[0marn[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m            = "Managed by Terraform"
      [32m+[0m [0m[1m[0megress[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mingress[0m[0m                = [
          [32m+[0m [0m{
              [32m+[0m [0mcidr_blocks      = [
                  [32m+[0m [0m"22.22.22.22/32",
                ]
              [32m+[0m [0mdescription      = ""
              [32m+[0m [0mfrom_port        = 8080
              [32m+[0m [0mipv6_cidr_blocks = []
              [32m+[0m [0mprefix_list_ids  = []
              [32m+[0m [0mprotocol         = "tcp"
              [32m+[0m [0msecurity_groups  = []
              [32m+[0m [0mself             = false
              [32m+[0m [0mto_port          = 8080
            },
        ]
      [32m+[0m [0m[1m[0mname[0m[0m                   = "terraform-example-instance"
      [32m+[0m [0m[1m[0mowner_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mrevoke_rules_on_delete[0m[0m = false
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                 = (known after apply)
    }

[1m  # aws_security_group.instance-sg-2[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_security_group" "instance-sg-2" {
      [32m+[0m [0m[1m[0marn[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m            = "Managed by Terraform"
      [32m+[0m [0m[1m[0megress[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mingress[0m[0m                = [
          [32m+[0m [0m{
              [32m+[0m [0mcidr_blocks      = [
                  [32m+[0m [0m"22.22.22.11/32",
                ]
              [32m+[0m [0mdescription      = ""
              [32m+[0m [0mfrom_port        = 8080
              [32m+[0m [0mipv6_cidr_blocks = []
              [32m+[0m [0mprefix_list_ids  = []
              [32m+[0m [0mprotocol         = "tcp"
              [32m+[0m [0msecurity_groups  = []
              [32m+[0m [0mself             = false
              [32m+[0m [0mto_port          = 8080
            },
        ]
      [32m+[0m [0m[1m[0mname[0m[0m                   = "terraform-example-instance-2"
      [32m+[0m [0m[1m[0mowner_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mrevoke_rules_on_delete[0m[0m = false
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                 = (known after apply)
    }

[1m  # aws_security_group.instance-sg-3[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_security_group" "instance-sg-3" {
      [32m+[0m [0m[1m[0marn[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m            = "Managed by Terraform"
      [32m+[0m [0m[1m[0megress[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mingress[0m[0m                = [
          [32m+[0m [0m{
              [32m+[0m [0mcidr_blocks      = [
                  [32m+[0m [0m"11.11.11.11/32",
                ]
              [32m+[0m [0mdescription      = ""
              [32m+[0m [0mfrom_port        = 8080
              [32m+[0m [0mipv6_cidr_blocks = []
              [32m+[0m [0mprefix_list_ids  = []
              [32m+[0m [0mprotocol         = "tcp"
              [32m+[0m [0msecurity_groups  = []
              [32m+[0m [0mself             = false
              [32m+[0m [0mto_port          = 8080
            },
        ]
      [32m+[0m [0m[1m[0mname[0m[0m                   = "terraform-example-sg-3"
      [32m+[0m [0m[1m[0mowner_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mrevoke_rules_on_delete[0m[0m = false
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                 = (known after apply)
    }

[0m[1mPlan:[0m 3 to add, 0 to change, 0 to destroy.[0m

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d running/sg2`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.capstage.net/lock?id=sarveshhh%252Fatlantis-example%252Frunning%252Fsg2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d running/sg2`
</details>

---
### 3. dir: `.` workspace: `default`
**Plan Error**
```
exit status 1: running "terragrunt init" in "/home/atlantis/.atlantis/repos/sarveshhh/atlantis-example/14/default": 
[terragrunt] 2020/08/28 11:55:24 Error reading file at path /home/atlantis/.atlantis/repos/sarveshhh/atlantis-example/14/default/terragrunt.hcl: open /home/atlantis/.atlantis/repos/sarveshhh/atlantis-example/14/default/terragrunt.hcl: no such file or directory
[terragrunt] 2020/08/28 11:55:24 Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 4. dir: `running` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
exit status 1: running "terragrunt plan" in "/home/atlantis/.atlantis/repos/sarveshhh/atlantis-example/14/default/running": 
[terragrunt] [/home/atlantis/.atlantis/repos/sarveshhh/atlantis-example/14/default/running] 2020/08/28 11:55:25 Running command: terraform --version
[terragrunt] 2020/08/28 11:55:25 Terraform version: 0.12.28
[terragrunt] 2020/08/28 11:55:25 Reading Terragrunt config file at /home/atlantis/.atlantis/repos/sarveshhh/atlantis-example/14/default/running/terragrunt.hcl
[terragrunt] [/home/atlantis/.atlantis/repos/sarveshhh/atlantis-example/14/default/running] 2020/08/28 11:55:25 Initializing remote state for the s3 backend
[terragrunt] [/home/atlantis/.atlantis/repos/sarveshhh/atlantis-example/14/default/running] 2020/08/28 11:55:25 WARNING: encryption is not enabled on the S3 remote state bucket capterra-terraform-state-944864126557. Terraform state files may contain secrets, so we STRONGLY recommend enabling encryption!
[terragrunt] [/home/atlantis/.atlantis/repos/sarveshhh/atlantis-example/14/default/running] 2020/08/28 11:55:25 WARNING: Versioning is not enabled for the remote state S3 bucket capterra-terraform-state-944864126557. We recommend enabling versioning so that you can roll back to previous versions of your Terraform state in case of error.
[terragrunt] [/home/atlantis/.atlantis/repos/sarveshhh/atlantis-example/14/default/running] 2020/08/28 11:55:25 Running command: terraform init -backend-config=region=us-east-1 -backend-config=bucket=capterra-terraform-state-944864126557 -backend-config=key=./terraform.tfstate
[0m[1mTerraform initialized in an empty directory![0m

The directory has no Terraform configuration files. You may begin working
with Terraform immediately by creating Terraform configuration files.[0m
[terragrunt] 2020/08/28 11:55:25 Running command: terraform plan
[31m
[1m[31mError: [0m[0m[1mMissing key/value separator[0m

[0m  on terraform.tfvars line 3:
   2: [4m[0m
[0m   3: remote_state [4m{[0m
[0m
Expected an equals sign ("=") to mark the beginning of the attribute value.
[0m[0m
[terragrunt] 2020/08/28 11:55:25 Hit multiple errors:
exit status 1

[terragrunt] [/home/atlantis/.atlantis/repos/sarveshhh/atlantis-example/14/default/running] 2020/08/28 11:55:24 Running command: terraform --version
[terragrunt] 2020/08/28 11:55:24 Terraform version: 0.12.28
[terragrunt] 2020/08/28 11:55:24 Reading Terragrunt config file at /home/atlantis/.atlantis/repos/sarveshhh/atlantis-example/14/default/running/terragrunt.hcl
[terragrunt] 2020/08/28 11:55:24 Initializing remote state for the s3 backend
[terragrunt] 2020/08/28 11:55:24 WARNING: encryption is not enabled on the S3 remote state bucket capterra-terraform-state-944864126557. Terraform state files may contain secrets, so we STRONGLY recommend enabling encryption!
[terragrunt] 2020/08/28 11:55:24 WARNING: Versioning is not enabled for the remote state S3 bucket capterra-terraform-state-944864126557. We recommend enabling versioning so that you can roll back to previous versions of your Terraform state in case of error.
[terragrunt] 2020/08/28 11:55:24 Running command: terraform init -backend-config=bucket=capterra-terraform-state-944864126557 -backend-config=key=./terraform.tfstate -backend-config=region=us-east-1
[0m[1mTerraform initialized in an empty directory![0m

The directory has no Terraform configuration files. You may begin working
with Terraform immediately by creating Terraform configuration files.[0m

```
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
